#Task 1
#Определение четного или нечетного числa. Напишите программу, которая проверяет является ли введенное число четным или нечетные

#Task 2
#Сделайте канкульятор добавив все элементы из математики. И запросите у пользователя цифру, если пользователь дает неправильные значение сделайте ошибку красивее.

#Task 3
#Ссортировка чисел/слов. Напишите код которыей ссоритрует чисел или слов

#Task 4
#Угадай число. Напишите программу на подобие игру угадать число. Попросите у пользователя загадать число от 1 до 100,
#напишите программу которая будет пытаться угадать число. Если пользователь дает неправильно или зацензуренное значие,
#То пусть программа даст ошибку где обьясняет правильно и красиво.

#Task 5
#Разроботка простого игрового приложения:
#Определите класс character сатрибутами: "name", "health', и 'attack power*.
#Реализуйте методы для атаки другого персонажа и получения урона.
#Создайте подклассы "warrior" и "Mage" "Healer" "Assassin" "Tank" "Healper", которые наследуют "character и добавляют уникальные способности.